app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$r64MW99ogTcgETZw4BJukO5bRGvpBxteyecF/e4JqfOLq7vTX78GW"], ["updated_at", "2015-06-13 14:06:59.757271"], ["id", 1]]
---
	def update
		@user = User.find(params[:id])

		if @user.update(user_params)